### DataFrame_Pandas

### boolean
-True & False로 받아줌

In [1]:
print(True == False)
print(True == True)
print(True !=0)
print(False ==0)
print(True or False)
print(1 =='1')

In [2]:
eng='Korea COVID 19'
print(eng.lower())
print(eng.upper())

In [3]:
EN='Python'
print(EN.lower())
print(EN.upper())

In [4]:
data=['재홍','유빈',2,3,4]
t=(1,2,3,4,5)
d={'name':'일',2:'이'}

In [5]:
data[1],data[4]

('유빈', 4)

In [6]:
data[2:]

[2, 3, 4]

In [7]:
data[0]='석찬'

In [8]:
#t[0]=일' # 튜플의 요소는 기본적으로는 바꿀 수 없다.

In [9]:
d['name']

'일'

In [10]:
d.keys()

dict_keys(['name', 2])

In [11]:
d.values()

dict_values(['일', '이'])

In [12]:
type(data),type(t),type(d)

(list, tuple, dict)

In [13]:
t

(1, 2, 3, 4, 5)

In [14]:
d

{'name': '일', 2: '이'}

In [15]:
Iunch = {'햄버거','치킨','라면','콜라',10000}
dinner = {'피자','족발','라면','콜라',10000}

In [16]:
Iunch & dinner

{10000, '라면', '콜라'}

In [17]:
dinner | Iunch

{10000, '라면', '족발', '치킨', '콜라', '피자', '햄버거'}

In [18]:
a=[1,2,3]
b=['치킨','피자','고구마']

In [19]:
a.append(400)

In [20]:
a

[1, 2, 3, 400]

In [21]:
a

[1, 2, 3, 400]

In [22]:
b

['치킨', '피자', '고구마']

In [23]:
s1=[a,b]

In [24]:
import pandas as pd

In [25]:
pd.Series(s1)

0    [1, 2, 3, 400]
1     [치킨, 피자, 고구마]
dtype: object

In [26]:
pd.DataFrame(s1)

    0   1    2      3
0   1   2    3  400.0
1  치킨  피자  고구마    NaN

In [27]:
man=[
    {'name':'은주','age':20,'job':'j1'},
    {'name':'민서','age':30,'job':'j2'},
    {'name':'경민','age':40,'job':'j3'}
]
da=pd.DataFrame(man,index=[1,2,3])

In [28]:
da

  name  age job
1   은주   20  j1
2   민서   30  j2
3   경민   40  j3

In [29]:
da_1={'이름':['은주','민서','경민'],
      '나이':[20,30,40],
      '직업':['j1','j2','j3']
     }

In [30]:
pd.DataFrame(da_1,index=[1,2,3])

   이름  나이  직업
1  은주  20  j1
2  민서  30  j2
3  경민  40  j3

In [31]:
d=['일','이','삼','사','오']

In [32]:
pd.DataFrame(d,index=[1,2,3,4,5],columns=['이름'])

  이름
1  일
2  이
3  삼
4  사
5  오

In [33]:
print(a=='a')
print(True==a)
print(1 == a)

False
False
False

In [34]:
dt=[]
dt.append('java')
dt[0], dt[-1], dt[1:], dt[:2]

('java', 'java', [], ['java'])

In [35]:
dt.sort()

In [36]:
dt

['java']

In [37]:
dt.reverse()

In [38]:
dt

['java']

In [39]:
b=(1,2,3,'사','오')
c=1,2,3
type(b),type(c)

(tuple, tuple)

In [40]:
b[3:],b[1:4]

(('사', '오'), (2, 3, '사'))

In [41]:
dic={'name1':'경민','학번1':20103,'name2':'경민2','학번2':20104}
dic.get('name1')

'경민'

In [42]:
dic.keys()

dict_keys(['name1', '학번1', 'name2', '학번2'])

In [43]:
dic.values()

dict_values(['경민', 20103, '경민2', 20104])

In [44]:
dat=[]
dat.append('Python')
dat[0],dat[:1],dat[-1],dat[2:]

('Python', ['Python'], 'Python', [])

In [45]:
d=5,4,3,2,1
e=('안','녕','하','세','요')
e[:5],e[0:2]
d[0]==1

False

In [55]:
person=[
    ['a',100,80],['b',17,60],['b',50,40],['d',90,80]
]
col_name=['name','국어','영어']
da=pd.DataFrame.from_records(person,columns=col_name,index=[1,2,3,4])

In [56]:
da

  name   국어  영어
1    a  100  80
2    b   17  60
3    b   50  40
4    d   90  80

In [54]:

da[['국어','영어']]>70

      국어     영어
1   True   True
2  False  False
3  False  False
4   True   True

In [58]:
A= {'소설':['아몬드','시선으로부터','일의 기쁨과 슬픔'],
     '저자':['손원평','정세랑','장류진']}
pd.DataFrame(A,index=[1,2,3])

          소설   저자
1        아몬드  손원평
2     시선으로부터  정세랑
3  일의 기쁨과 슬픔  장류진